app/views/comments/_comment.html.erb

INSERT INTO "comments" ("content", "created_at", "experience_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "This will work"], ["created_at", Wed, 12 Sep 2012 06:00:07 UTC +00:00], ["experience_id", 17], ["updated_at", Wed, 12 Sep 2012 06:00:07 UTC +00:00], ["user_id", nil]]
---
<span class="item-comments"><%= comment.content %></span>
<span class="item-footer">Guest posted a comment <%= time_ago_in_words comment.created_at %>.</span>