app/views/walls/show.html.erb

    }
    $(function(){
        //check activerecord for new entry, load new entry to masonry
        $('#secretReload').click(function(){
            $items = $('.item.new');
            $itemContent = $($(this).html());
            $container.masonry('remove',$items);
            $container.imagesLoaded(function(){
                $container.prepend($itemContent).masonry('reload');
            });
            $(this).empty();
        });
        $('#menu-msg').click(function(){
            if($('.item.new.msg').length>0){
                $items=$('.item.new.msg');
                $container.masonry('remove', $items).masonry('reload');
            }else{
                $itemContent = $('<div class="item new msg"><%= escape_javascript(render template: "experiences/new_message")%></div>');
                $container.prepend($itemContent).masonry('reload');
                $('.item.new.msg textarea').focus();
            }
        });
---
SELECT "experiences".* FROM "experiences" ORDER BY created_at desc