app/views/experiences/_experience.html.erb

INSERT INTO "experiences" ("content", "content_type", "created_at", "tag", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "fds"], ["content_type", nil], ["created_at", Wed, 29 Aug 2012 07:37:16 UTC +00:00], ["tag", nil], ["updated_at", Wed, 29 Aug 2012 07:37:16 UTC +00:00], ["user_id", nil]]
SELECT 1 FROM "comments" WHERE "comments"."experience_id" = 1 LIMIT 1
---
	<%end%>
	<span class='item-footer'>Guest posted a message <%= time_ago_in_words experience.created_at %>. <%= link_to 'Comment', new_experience_comment_path(experience), class:'item-addcomment', remote: true %></span>
	<% if experience.comments.exists? %>