app/views/experiences/create.html.erb

INSERT INTO "experiences" ("col", "content", "content_type", "created_at", "photo", "row", "tag", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
<script>
	var $itemContent='<div class="item"><span class="item-body"></span><span class="item-photo"><%= escape_javascript(image_tag @experience.photo_url(:thumb).to_s)%></span><span class="item-footer">Guest posted a message <%= escape_javascript(time_ago_in_words @experience.created_at) %>.</span></div>';