app/views/experiences/create.js.erb

INSERT INTO "experiences" ("content", "content_type", "created_at", "tag", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "hello"], ["content_type", nil], ["created_at", Tue, 28 Aug 2012 12:57:50 UTC +00:00], ["tag", nil], ["updated_at", Tue, 28 Aug 2012 12:57:50 UTC +00:00], ["user_id", nil]]
---
$container.masonry( 'remove', $items );
$itemContent=$('<div class="item"><span class="item-body"><%= escape_javascript(@experience.content) %></span><span class="item-footer">Guest posted a message <%= escape_javascript(time_ago_in_words @experience.created_at) %>.</span></div>');