app/controllers/comments_controller.rb

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", "2"]]
---
	def new
		@experience = Experience.find(params[:experience_id])

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("content", "created_at", "experience_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "comment to second message"], ["created_at", Mon, 10 Sep 2012 15:20:09 UTC +00:00], ["experience_id", nil], ["updated_at", Mon, 10 Sep 2012 15:20:09 UTC +00:00], ["user_id", nil]]
---
	def create
		@experience = Experience.find(params[:experience_id])
		@comment = @experience.comments.create(params[:comment])