app/controllers/experiences_controller.rb

INSERT INTO "experiences" ("content", "content_type", "created_at", "tag", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "hello"], ["content_type", nil], ["created_at", Tue, 28 Aug 2012 12:57:50 UTC +00:00], ["tag", nil], ["updated_at", Tue, 28 Aug 2012 12:57:50 UTC +00:00], ["user_id", nil]]
---
	def create
		@experience = Experience.create(params[:experience])