app/controllers/walls_controller.rb

SELECT "experiences".* FROM "experiences" ORDER BY created_at desc
---
	def show
		@experiences = Experience.order("created_at desc")